<template><div><h1 id="阿里p10带多少人-阿里p10是什么级别" tabindex="-1"><a class="header-anchor" href="#阿里p10带多少人-阿里p10是什么级别"><span>阿里P10带多少人？阿里p10是什么级别？</span></a></h1>
<h2 id="p10-带多少人" tabindex="-1"><a class="header-anchor" href="#p10-带多少人"><span>P10 带多少人？</span></a></h2>
<p>一般来说，在阿里 P 是技术系，M 是管理系。但 P 也是带人的，例如阿里 P10 毕玄在<a href="https://time.geekbang.org/column/article/576252" target="_blank" rel="noopener noreferrer">访谈</a>中透露，他在淘系曾带 600 人。我查了一下，其他等级例如 P9 大概带 50~100 人，P8 带 2~30 人。P7 是技术专家/架构师，应该是不带人的。</p>
<!-- more -->
<p>各个技术等级是这样的：</p>
<table>
<thead>
<tr>
<th>等级</th>
<th>职称</th>
<th></th>
</tr>
</thead>
<tbody>
<tr>
<td>P5</td>
<td>高级工程师</td>
<td>校招起点</td>
</tr>
<tr>
<td>P6</td>
<td>资深工程师</td>
<td>社招起点，1~3 年工作经验，代码主力</td>
</tr>
<tr>
<td>P7</td>
<td>技术专家/架构师</td>
<td>5~7 年工作经验，代码主力</td>
</tr>
<tr>
<td>P8</td>
<td>高级技术专家</td>
<td>一线最高级别，带 2~30 人</td>
</tr>
<tr>
<td>P9</td>
<td>资深技术专家</td>
<td>有行业影响力，带 50~100 人，可以权衡架构方案利弊</td>
</tr>
<tr>
<td>P10</td>
<td>研究员/科学家</td>
<td>有行业影响力+有影响力的成果，带 100~1000 人</td>
</tr>
</tbody>
</table>
<p>行业影响力一般指有粉丝多的博客/公众号/视频号，出版过技术图书，在维护知名的开源项目等。在这个层次只是走到了技术前沿，但没有走过前沿。</p>
<p>有影响力的成果一般指出版的图书，或开源项目，或其他专利成果等，获得了一定的市场认可，已经走过了技术前沿，已经有创新了。到达 P10，相当于计算机领域没有学位的博士。</p>
<h2 id="在公司里做事的出发点" tabindex="-1"><a class="header-anchor" href="#在公司里做事的出发点"><span>在公司里做事的出发点</span></a></h2>
<p>出发点在职场中很重要。公司中总是充满各种矛盾，如果下属与上级之间一直没有分歧与争执，这多半是有问题的，这只是意味着矛盾被忽略或隐瞒了，没有被真正对待和解决。</p>
<p>下属与上级对话，一个很重要的原则是：出发点始终站在公司这边。你可以站在所在团队的立场，与上司谈要求，这种情况有时候能成有时候不能成；你也可以站在事业部或分公司，站在你的上司所在的单位谈，这种情况下也并不能保证 100% 成功；你还可以站在整个公司、整个集团的角度谈，从这个角度可能也不能如愿，但一般不会失败。</p>
<p>程序员个人做事，与在公司里做事的立场是完全不同的。个人开一个开源项目，出发点可以是藉由项目实践完善自己的技术体系，也可以是实现自己的一个技术设想，或者为社会上的一部分人带去实用价值。在公司里做事不是这样的，只有将出发点放在公司这边，才能一直顺风顺水；如果在公司里做事，仍然坚持个人做事的出发点，是早晚会出问题的，很多程序员因为太痴迷于技术，往往无意间忽略了这一点。</p>
</div></template>


