<template><div><p><img src="@source/posts/2023/assets/F92WBRobgAA3aRt.png" alt="Image"></p>
<h1 id="读《诡异世界-我以肉身镇万物》-聊小说开篇的期待感及创作过程中作者对读者观感的把控" tabindex="-1"><a class="header-anchor" href="#读《诡异世界-我以肉身镇万物》-聊小说开篇的期待感及创作过程中作者对读者观感的把控"><span>读《诡异世界，我以肉身镇万物》，聊小说开篇的期待感及创作过程中作者对读者观感的把控</span></a></h1>
<p>你好，今天谈一下最近看的小说。它是起点新书榜上的一本小说，成绩是很不错的。</p>
<p>它的分类是玄幻高武，但我感觉它像都市，它的文笔细腻而真实，只有在世界观设定上，有武修、仙修的设定，这是属于玄幻世界的内容。如果它没有这方面的设定，它应该属于架空历史。</p>
<p>真正的网文创作应该也是清苦的，像一场路途很长的独自旅行，且还只能步行。作者需要保持日更，每天仔细地表述主角周围发生的事情，用它们展现主角的性格，或实现爽点的展现。</p>
<p>大多数时候作者写的都是日常，只能表现主角的性格，作者大概认为它应该写，所以就写了。<strong>之所以这样的流水情节读者能有耐心看下去，是因为在开篇的时候——特别在前 3 章甚至第 1 章，作者把期待感拉满了。</strong></p>
<p>期待感，是非常非常非常重要的一个东西。</p>
<p>以这本书而论，第一个大期待感就是主角陈墨给张瑜赎身。在作者的这个期待将被满足之前，作者又给读者拉起了另一个期待：主角参加武举，拿下名次。</p>
<p>期待就像被串起来的珍珠，一个接着一个。拉起一个期待，你不能迅速让读者满足，怎么也要水上 20 章；但也不可能一个期待贯穿全书，该满足读者的时候就满足，只是在满足旧的期待之前，须拉起新的期待。</p>
<p>**故事情节走到的每一步，主角怎么想、怎么做，周围的人怎么想、怎么做，这些都属于想象力的范畴。是作者的想象力+常识推理的结果。**并没有一定的规矩说，读者读到这里一定会有什么样的想法，没有，不是的，读者群体大概是那样的想法，但具体每一个读者身上，每个人的想法又可能是不同的。</p>
<p>我们在小说的章评评论区经常看到读者有时候对作者当前撰写的情节指手划脚，这是为什么？这就是作者对读者观感的把控出现了小小的失误。</p>
<p>为了避免这种“失误”，为了让读者朝作者预定的方向去想，作者往往要特意描写一些额外的情节，或直接点出某些历史背景，请读者往预定的方向去想。作者在创作的时候，在每一个具体更新的节点，他想到了很多，如果以数字计数，例如 100 个，在他真正落实在纸面上的时候，可能只有 10 个被采纳。</p>
<p>那些不利于展现主角性格、不利于以主角为核心展现爽点的情节或话语，都被作者有选择性地忽略了。有时候读者在书中走着走着，突然发现：“咦，这里真巧啊！”</p>
<p>是的，真巧！这是作者故意保留的，“不巧”的内容都被作者故意剔除了嘛。</p>
<p>这个过程，就像作者在控制一个圆球，圆球随意滚动就像读者，作者用自己创作的情节，小心引导读者向预定的方向前进。</p>
<p>这种把控，没有什么“包治百病的灵感妙药”，它是常识推荐+想象力共同作用的结果。有什么办法可以增加这种“功力”呢？</p>
<ul>
<li>多读相关题材的优秀小说；</li>
<li>适当看一看书评，注意一下读者的阅读感受；</li>
<li>多读文化与历史方面的图书，尽可能做一些文化、历史方面的思考与评论。</li>
</ul>
<p>多做以上这些事情，探长相信对创作小说大有裨益。无论是什么题材的小说，它们只是因世界观设定不同而分类不同，它们描写的人性都是共通的。阅读、思考与评论文化、历史方面的内容，对创作所有题材的小说都是有帮助的。</p>
</div></template>


