<template><div><p>你好，今天特意聊一下网文中的逻辑。逻辑在网文创作中有什么样的作用和地位？</p>
<h2 id="关键问题是爽点情节尴尬、生硬和无脑" tabindex="-1"><a class="header-anchor" href="#关键问题是爽点情节尴尬、生硬和无脑"><span>关键问题是爽点情节尴尬、生硬和无脑</span></a></h2>
<p>几乎每个网文作者都知道，装逼打脸非常重要，是核心技能。那么，我们对装逼打脸的领悟是什么？有多少人真正理解这四个字的真正含义呢？</p>
<p>先简单说一下什么是装逼打脸吧。举个简单的例子：</p>
<blockquote>
<p>同学聚会，同学嘲讽，主角打脸，同学都大跌眼镜，原来昔日的小屌丝同学如今已经是神豪了，一个个态度大变。</p>
</blockquote>
<p>这就是一个一句话描写的装逼打脸。</p>
<p>都市装逼文，无非就是把这句话扩写而已，扩写成一部几十万、甚至上百万的长篇小说。</p>
<p>关键点来了，这个装逼打脸的核心是什么，或者说关键点是什么？</p>
<p><strong>新手写装逼打脸，遇到最大的问题不是他写不了一个完整的装逼打脸情节，而是写的情节显得尴尬、生硬和无脑。</strong></p>
<p>飞卢网站的都市书，收藏低的书评区也经常有读者喷，大概有这样的问题；</p>
<blockquote>
<p>1）又见无脑装逼。</p>
<p>2）装逼真尴尬，我们鸡皮疙瘩都起来了。</p>
<p>3）这真是生般硬凑出来的打脸啊，干脆把配角的脸伸到主角面前算了。</p>
</blockquote>
<p>所以，你要写好装逼打脸，就要从这三个问题入手了。</p>
<h2 id="解决问题的关键是重视铺垫和人设" tabindex="-1"><a class="header-anchor" href="#解决问题的关键是重视铺垫和人设"><span>解决问题的关键是重视铺垫和人设</span></a></h2>
<p>先说第1个问题：无脑。这个无脑是作者需要有脑，读者无脑看，但是他无脑看如果你有个情节或者设定N，太出戏，他就得出来喷你了。</p>
<p>这个无脑并不是我们今天讲的重点，以后我们会专门说一下飞卢的脑子是什么，以及如何几句话让书变得有脑。</p>
<p>至于第2个和第3个问题，是相辅相成的，一起讲。</p>
<p>你想写的不生硬，不尴尬，首先排除你的文笔和其他创作条件，就说情节。</p>
<p>是情节哪里出问题了，导致这段情节读者看起来生硬和尴尬呢？</p>
<p><strong>我们一般的理解是，缺乏圆润的部分，润滑剂。这个润滑剂就是铺垫和人设。</strong></p>
<p>有了铺垫和人设，甚至你的情节都变得有脑了。</p>
<p>人设和铺垫，也是很多飞卢大佬讲解都市最核心的东西。</p>
<p>但是并没有谁真的再深入一步的讲解人设和铺垫，大部分的装逼打脸帖子都是教你装逼的分类，什么震惊法，KTV场景装逼套路，如何花式装逼等等。</p>
<h2 id="如何进行铺垫和打造角色人设" tabindex="-1"><a class="header-anchor" href="#如何进行铺垫和打造角色人设"><span>如何进行铺垫和打造角色人设</span></a></h2>
<p>我们继续，下面举例子讲解一下人设和铺垫，以及如何通过这两点让装逼打脸不那么尴尬，生硬。</p>
<p>常见的小说中食堂吃饭场景，直接提取装逼打脸情节。例子是这样的：</p>
<blockquote>
<p>视角给到主角和张三身上，张三挤了主角一下反倒把自己绊了个趔趄。</p>
<p>张三喷：主角你走路不长眼么，把老子的饭都差点弄撒了。</p>
<p>主角站在道德制高点，说：张三，明明是你走路撞到我们，只是你虚胖没我们站得稳。</p>
<p>张三恼怒了，上来干主角，主角反而一拳将他打倒在地上。</p>
</blockquote>
<p>这就是一次打脸，大家看着尴尬不尴尬，圆润不圆润？</p>
<p>相信读者一看就点关闭页面退出了，原因很简单：一，无逼格；二，看得没头没脑；三、反派张三是个智障么，明明是被人一巴掌干倒的战五渣实力，为什么还这么狂，他是怎么活到现在的？</p>
<p>你要想把这段在生活中无时无刻可能都重现的情节，写到圆润自然，装逼不尬，有脑，必须要加入刚才我们提到的人设和铺垫。</p>
<p><strong>人设和铺垫是相辅相成的，都是为了主角装逼打脸做贡献、添砖加瓦的。</strong></p>
<p>这两样东西同时又可以引出潜在的期待感。<strong>期待感这东西怎么来的，就是人设和铺垫衬托出来的。</strong></p>
<p>我们继续用刚才那个例子讲解，修改过前置增加的内容是这样的：</p>
<blockquote>
<p>主角开局获得了拳王系统，新手大礼包将主角身体和拳击术提高到职业一流水平。</p>
<p>张三人高马大是学校出名的混混，恶事做绝，在食堂打饭从来都是不排队，看谁不顺眼就拳打脚踢。</p>
<p>......</p>
</blockquote>
<p>这两句话就是简单的人设和铺垫。</p>
<p>主角有了一流职业拳手的实力，一拳几百斤的实力那种，打普通人还不是一拳秒杀。</p>
<p>然后反派又是个很可恶很嚣张的人渣。</p>
<p>反派与主角开始碰撞，两个角色开始交织起来。期待感也起来了。有了冲突矛盾，然后主角讲完道理，对方恼羞成怒先动手，结果主角一拳秒了对方。这样，情节看起来就顺畅许多，打脸也自然。</p>
<p>同样举一反三，再举个例子，你写美女，写多么美，多少人追，读者看了就会有期待感，有主角一定要收了这个美女的期待感。后面如果你不让主角收，反而被反派收了，读者能喷死你。</p>
<p>这是最基本的人设和铺垫，应用到具体的小说里，这个铺垫肯定要更完善的，字数不可能这么少，甚至可以铺垫好几章。</p>
<p>举个例子，比如我们再随便延伸一下，张三被秒，知道主角武力无双，于是动用权利，他叔叔是教导主任。这时候，你如何再装逼打脸呢？还是要铺垫，铺垫更多的内容。</p>
<p><strong>一本书，铺垫故事环节比打脸环节还重要。</strong></p>
<p>打脸情节的形式一般是这样的：</p>
<ul>
<li>打脸环节你可以选择写的平淡，对方尴尬抱拳，说我们输了就行。</li>
<li>也可以选择打的对方脸啪啪响，对方磕头认错，或者以前无线文那套“打了小的来老的，不死不休的套路”都行。</li>
<li>也可以无形装逼，主角不说我厉害，但是你知道我很厉害，各种恭维巴结跪舔。</li>
</ul>
<p>这里补充一下，如果你的人设和铺垫都没弄好，一个富二代对你跪舔，你觉得尴尬突兀不？脑子呢？如果人设是主角上来签到领了某房地产公司 80% 的股权，而这个富二代的老爹自己开了个小公司，靠那个房地产公司吃饭，富二代知道了主角的这层身份后，再跪舔是不是合理多了？甚至得把老爹拉过来一起跪舔。</p>
<p>根据人设和铺垫开发各种爽点，拉各种期待感。当然，你要拉对读者想看的期待感，拉偏了虽然是爽文，但是会掉订阅。飞卢一个毒点少说掉几百订，多了甚至会雪崩。比如武侠小说，看的就是靠武力碾压，结果主角跟人比谁文采好......这就是拉期待感拉错了，导致爽点也偏了。</p>
<h2 id="情节铺垫和打造人设的关键是逻辑" tabindex="-1"><a class="header-anchor" href="#情节铺垫和打造人设的关键是逻辑"><span>情节铺垫和打造人设的关键是逻辑</span></a></h2>
<p>最后，要强调一下，进行小高潮情节之前的铺垫，以及人设的打造，这里面最要的一点就是逻辑，人物性格一定要前后一致、统一，情节发展要符合常识推荐。做到了这一点有时候也称之为情节圆润。</p>
</div></template>


