<template><div><p><img src="@source/posts/2023/assets/Lex对马斯克的全面采访-封面.jpg" alt="Lex对马斯克的全面采访-封面"></p>
<p>https://youtu.be/l1Cf8iq6k1w</p>
<p>这是 <a href="https://twitter.com/lexfridman/status/1722686021781835928" target="_blank" rel="noopener noreferrer">Lex Fridman</a> 对马斯克做的第 4 次采访，也是它博客上第 400 个采访，涉及内容十分广泛，时间目录如下所示。</p>
<ul>
<li>
<p>0:00 - 简介</p>
</li>
<li>
<p>0:07 - 战争与人性</p>
</li>
<li>
<p>4:33 - 以色列-哈马斯战争</p>
</li>
<li>
<p>10:41 - 军工综合体</p>
</li>
<li>
<p>14:58 - 乌克兰战争</p>
</li>
<li>
<p>19:41 - 中国</p>
</li>
<li>
<p>33:57 - xAI 格罗克（Grok）</p>
</li>
<li>
<p>44:55 - 外星人</p>
</li>
<li>
<p>52:55 - 神</p>
</li>
<li>
<p>55:22 - 暗黑破坏神 4 和视频游戏</p>
</li>
<li>
<p>1:04:29 - 反乌托邦世界：1984 年和美丽新世界</p>
</li>
<li>
<p>1:10:41 - 人工智能和每瓦有用的计算</p>
</li>
<li>
<p>1:16:22 - 人工智能监管</p>
</li>
<li>
<p>1:23:14 - 人工智能应该开源吗？</p>
</li>
<li>
<p>1:30:36 - X 算法</p>
</li>
<li>
<p>1:41:57 - 2024 年总统选举</p>
</li>
<li>
<p>1:54:55 - 政治</p>
</li>
<li>
<p>1:57:57 - 信任</p>
</li>
<li>
<p>2:03:29 - 特斯拉的自动驾驶仪和 Optimus 机器人</p>
</li>
<li>
<p>2:12:28 - 艰辛</p>
</li>
</ul>
<p>原视频是英文的，我使用工具加上中文字幕，方便国内读者观看。个别地方自动翻译不准确，需自行甄别纠正。</p>
<h2 id="中国威胁问题" tabindex="-1"><a class="header-anchor" href="#中国威胁问题"><span>中国威胁问题</span></a></h2>
<p>在论到中国在成为世界强国后会不会对世界产生威胁，马斯克表示，不会。中国是一个历史悠久的国家，在三国时期曾有过十分激烈的内战，人口几乎损失了七成，这是非常糟糕的。但中国在历史上没有侵略过其它国家，中国像一个集合体，有很强的包容性，但没有主动侵略过其他国家。所以，马斯克认为中国的强大对于世界而言，是安全的。</p>
<h2 id="外星人问题" tabindex="-1"><a class="header-anchor" href="#外星人问题"><span>外星人问题</span></a></h2>
<p>没有。马斯克表示，如果 SpaceX 发现外星人的踪迹，将在 X 上第一时间发布。</p>
<p>等等，还有其它很多问题。</p>
<h2 id="马斯克为什么会接受这样的采访" tabindex="-1"><a class="header-anchor" href="#马斯克为什么会接受这样的采访"><span>马斯克为什么会接受这样的采访？</span></a></h2>
<p>以我们的文化很难想象一位顶级大佬会接受一名播主的采访，没有观众，只有他们两个人面对面地聊天。我将这个问题问了我能问的人，得到的答复是这样的：</p>
<p>Lex Fridman 是一位知名的研究员、播客主持人和公众人物，他在人工智能、技术、哲学等领域有着深入的研究和广泛的影响力。他的播客以深入、有见地的对话和对未来技术的探索而闻名。马斯克选择接受 Fridman 的采访，因为他的平台允许他在一个认真且通常较为深入的环境中讨论他的项目和愿景，Fridman 为马斯克提供了一个展示他想法和技术创新的良好机会。</p>
<p>接受这样的采访无关乎影响力，论影响力，X 可是顶级的，马斯克随便发一张帖子就应者百万。只关乎深入地思考，思考当下普遍值得思考的问题，没有多余的东西，回到了人与人交谈的本身。</p>
<p>没有利益，更没有计谋，没有其它任何东西。</p>
<p>@左耳朵耗子 还在世的时候，知名博主 @tinyfool 对他进行过一次采访，也是两个人，面对面交流。交流的内容中，部分是敏感的，以至于 @左耳朵耗子 生前视频都没有发出。后来 @左耳朵耗子 去世后，老友将这段专访拿了出来，以此纪念他。</p>
<p>在视频中，@左耳朵耗子 问 @tinyfool：你为什么想做这样的采访？</p>
<p>我感觉 @tinyfool 想做的就是 Lex Fridman 式的采访，是深入的交流与思考，所谈论的问题都是当下人类非常值得关注和思考的问题。但中外文化有差异，这样的播客目前在大陆应该很难开展起来。</p>
</div></template>


