<template><div><h1 id="声声慢·记-leatech-全球-cto-领导力峰会暨-tvp-二周年庆典" tabindex="-1"><a class="header-anchor" href="#声声慢·记-leatech-全球-cto-领导力峰会暨-tvp-二周年庆典"><span>声声慢·记 LeaTech 全球 CTO 领导力峰会暨 TVP 二周年庆典</span></a></h1>
<blockquote>
<p>声声慢·记 LeaTech 全球 CTO 领导力峰会暨 TVP 二周年庆典</p>
</blockquote>
<blockquote>
<p>12月4日、5日前往深圳参加了一个技术活动，5日晚上喝了点酒，第二天早上填了这首词。深圳有一种小吃叫三及第汤很不错，老板说汤里面清新的绿叶子是枸杞叶。还有，深圳人说普通话，问你要不要加肠，其实是问你要不要加汤。</p>
</blockquote>
<!-- more -->
<p>深圳滨海，东海朗廷，节气大雪行将。</p>
<p>大伽千里云聚，把盏共襄。</p>
<p>圆桌讨论犹记，有趣哉，不越篱墙。</p>
<p>带团队，无招胜有式，平展影响。</p>
<p>以技术创企业，连元素，协同驱动成长。</p>
<p>更有求败绝艺，计算车厢。</p>
<p>喜看他人日上，挥挥手，心莫忧伤。</p>
<p>立风口，待东风与便，再造辉煌。</p>
<p>2020年12月10日</p>
</div></template>


