<template><div><iframe width="1009" height="757" src="https://www.youtube.com/embed/6SQE_6ynj4s" title="[中英双字幕]AI春晚-OpenAI第一届开发者大会完整视频" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
<h1 id="昨天-openai-召开首届开发者大会-gpt-store-即将上线-智能化时代真的来临了" tabindex="-1"><a class="header-anchor" href="#昨天-openai-召开首届开发者大会-gpt-store-即将上线-智能化时代真的来临了"><span>昨天 OpenAI 召开首届开发者大会，GPT Store 即将上线，智能化时代真的来临了</span></a></h1>
<p>​你好，今天聊一下 OpenAI 的首届开发者大会。这次发布会被网友戏称为 AI 春节，相同的感觉在 2007 年有过一次，那一年过世的乔帮主给我们开启了智能手机时代。</p>
<p>这一次是奥特曼，不是日本打怪兽的那个奥特曼，是现实里 OpenAI 公司的 CEO。昨天，11 月 6 日，OpenAI 开始第一届蓄谋已久的开发者大会，向人们展示了 OpenAI 三项重大产品更新。</p>
<p>我为什么说这是蓄谋已久的？看了内容就明白了，每一项更新都直击开发者的软肋，我身为一名老工程师，都想重操旧业为 OpenAI 开发智能应用了。</p>
<p>首先是数据介绍，奥特曼说，已经有200 万开发者正在使用 OpenAI 的 API，全世界 92%的财富 500 强公司正在使用 OpenAI 的产品搭建服务，ChatGPT 的周活用户数也达到 1 亿人。、</p>
<p>对于这三项数据我早有预料，但真正看到官方披露的时候，也是微微感到震惊。这意味着，整个互联网的注意力，无论是 B 端，还是 C 端，都是向 AI 倾斜。这是给全世界开发者的风口，并不仅仅是已有的 200 万开发者。</p>
<h2 id="一-gpt-4-turbo" tabindex="-1"><a class="header-anchor" href="#一-gpt-4-turbo"><span>一，GPT-4 Turbo</span></a></h2>
<p>第一个登场的功能是 GPT-4 Turbo。</p>
<figure><img src="@source/posts/2023/assets/image-20231107195208765.png" alt="GPT-4 Turbo" tabindex="0" loading="lazy"><figcaption>GPT-4 Turbo</figcaption></figure>
<p>它相比旧的 GPT-4 和 GPT-3.5，主要有 6 项改进：</p>
<p>1，允许更长的上下文对话长度，这次升级后，基本上日常对话不需要考虑 token 不够用的情况了。由于用户抱怨，GPT-4 升过两次级，第一次升到 8192 个 token，第二次升到 3.2 万个 token，这一次直接涨到了 12.8 万个 token。普通的 200 页 PDF，对于新模型 GPT-4 Turbo 都可以一口吃下。</p>
<p>祝贺那些至今还没有用过 GPT-4 的人，现在他们没有必要使用 GPT-4 了，直接使用更强的 GPT Turbo 就可以了。</p>
<p>2，GPT Turbo 给了开发者更多的控制权。对于大语言模型 AI 都喜欢“一本正经胡说八道”的毛病，开发者可以通过访问 seed 参数和 system_fingerprint 响应字段，来确保实现“模型对每次请求都给出确定性的输出”。</p>
<p>3，新模型将知识库更新到了 2023 年 4 月，并且以后还会定期更新。GPT 3.5 一直被竞争对象嘲笑诟病的 2021 年 9 月，已经成为历史。</p>
<p>4，全面进入多模态时代。什么是多模态？就是不只是文本，语音、图片和视频都支持。发布会当天，文生图模型 DALL·E 3、具有视觉输入能力的 GPT-4 Trubo，以及新的声音合成模型（TTS），还有新的语音识别模型 Whisper V3 全部都发布更新了。</p>
<p>5，GPT-4 像它的前任 GPT 3.5 一样，也支持微调了。不过对于一般开发者这一项功能就不要惦记了，它是为 92%的世界 500 强公司准备的，因为针对特定领域训练 GPT-4 模型，奥特曼表示，这个成本并不便宜。</p>
<p>6，最后一项，是开发者调用 API 的速率提升了一倍，简单说就是反应速度变快了。返回结果的速度更快了，本质上是大语言模型的响应速度更快了。不知道 OpenAI 是怎么做到的，但从 4 月份固定知识库，10 月份正式发布，相信他们团队也付出了许多辛苦。</p>
<p>7，价格更低了。</p>
<figure><img src="@source/posts/2023/assets/image-20231107200553625.png" alt="价格对比" tabindex="0" loading="lazy"><figcaption>价格对比</figcaption></figure>
<p>调用 API 的价格分为输入价格和输出价值，GPT Turbo 模型相比前任，输入 Token 的价格只有 1/3，输出 Token 的价格只有 1/2，</p>
<p>总的来说就是，功能变强了、变快了，价格还变便宜了。</p>
<p>这是有可能的，大的东西都容易产生规模效应，OpenAI 的 AI 产品彻底成了气候以后，很难再有人撼动它的地位。甚至不远的将来，一些除 Meta、Google 之外的中小公司不再开发自己的 AI 产品，直接套牌 OpenAI 的产品了，因为这样更便宜、成本更低。</p>
<h2 id="二、自定义-gpt" tabindex="-1"><a class="header-anchor" href="#二、自定义-gpt"><span>二、自定义 GPT</span></a></h2>
<p>这个东西和上面提到的模型微调还不是一个东西，奥特曼说，用户可以通过自定义指令、拓展（模型）的知识边界和下达行动命令，来构建属于自己的 GPT，称之为用户的自定义 GPT。</p>
<figure><img src="@source/posts/2023/assets/image-20231107201529009.png" alt="自定义 GPT" tabindex="0" loading="lazy"><figcaption>自定义 GPT</figcaption></figure>
<p>它不需要编程，动动嘴说说话，动动手上传一些资料就可以了。</p>
<p>在现场演示中，奥特曼创作了一个创业咨询 GPT，还顺手生成了一个 Logo。随后奥特曼在属性页面中上传了一份他自己关于创业公司的演讲稿，向这个用例提供了额外的知识。至此，自定义用途的 GPT 就初步搭建完成了。神奇啊！</p>
<p>并且，官方宣称，稍后会有一个 GPT Store 上线，开发者将可以上架自己的智能应用并能在销售中拿到分成。现场的开发者们听到这个消息沸腾了，上一次他们听到类似的声音，还是在 2008 年，那一次乔帮主开启了 App Store。</p>
<h2 id="三、助理-api" tabindex="-1"><a class="header-anchor" href="#三、助理-api"><span>三、助理 API</span></a></h2>
<p>助理 API 是一个专门构建的人工智能。如今在 OpenAI 在线构建的产品和服务中，早已经不是单一的模型了，每个模型都有它自己独特的用途。</p>
<p>这个助理 API 提供了如代码解释器、检索以及函数调用等功能，用于处理此前开发者必须自己完成的许多繁重工作。对于该功能，OpenAI 的工作人员现场做了演示，他用语言告诉 AI：</p>
<p>“从开发者大会现场随机挑选 5 位观众，给他们的 OpenAI 账户里各充值 500 美金！”</p>
<p>结果，AI 完成了。</p>
<figure><img src="@source/posts/2023/assets/image-20231107202913243.png" alt="助理 API" tabindex="0" loading="lazy"><figcaption>助理 API</figcaption></figure>
<p>随后，这位工作人员为了安慰所有现场与会未中奖人员，再次向 AI 发出语言指令：</p>
<p>“给现场所有人的账户里打入 500 美元！”</p>
<p>AI 也完成了！</p>
<p>看到这个，探长震惊了！AI 了不起啊，它不仅能联网，还能调用程序，如果再给它一副可以行走的皮囊，相信 99% 的人都没有它能干！</p>
<p>对于现场参会人员，探长祝贺他们免费参加了一次 AI 春晚，门票价格是 450 美元，他们每人至少拿到了 500 美金，还赚了 50 块。希望国内举办大会的大厂大公司迅速学习与借鉴这种文化！</p>
<h2 id="回顾" tabindex="-1"><a class="header-anchor" href="#回顾"><span>回顾</span></a></h2>
<p>最后总结一下。</p>
<p>前两天，马斯克刚刚宣布 Grok 要上线，昨天奥特曼的首届开发者大会就召开了，大佬竟然也这么卷。过不了多久，一个 GPT Store 就会诞生，到时候又有很多开发者扑上去掘金。</p>
<p>探长常常感叹这个世界走得太快，而常常叹息自己行动缓慢，担心被时代的浪潮抛弃。</p>
<p>公众号兴起了，落下去了；短视频兴起了，还没有落下去，AI 兴起了。</p>
<p>​这是一个风口，相信有了开发者的加成，将涌现更多有价值、有趣的智能应用，传统行业的智能化数字化浪潮只会加快，不会回头或降速了。</p>
</div></template>


�的，分支名称、分支描述都是可以修改的。即使课程编号有变化，也有补救的措施。不像源码标签，打了以后就不好修改了。打源码标签这种方式，适合大佬，非常有经验的大佬，十拿十稳的那种；像我等，适用使用分支。</p>
<p>此外，我还有一个“大胆”的想法。因为小程序与web都是在可以直接在页面上展示运行结果的，我们看一下微信的官方文档就知道了，我们可以将课程与源码，在网站上直接做一个对应，也就是说，我学到某课的时候，比如第100课，旁边自动就出来第100课的源码，并且直接就可以在线预览效果。如果读者愿意，还可以直接启动微信开发者工具，在本地进行修改。</p>
<p>怎么实现这个功能呢？做一个Electron客户端软件，既可以展示web页面，又能呼起本地软件，还跨平台，上面提供的功能大体都是可以实现的。这是一个立体的、一体化的学习环境。</p>
<p>唯一美中不足的是，Electron的编译简直就是一个噩梦，不然我真想业务找点时间写写这个软件。</p>
<p>欢迎留言。</p>
<p>（2021年01月15）</p>
<p>后记：</p>
<blockquote>
<p>昨天只算小忙。我有一次周未录课，因为那一周特别忙，白天一直给学生上课，根本没时间备课，周五晚上备课到第二天早上5点多，简单吃个早点，就打车去录音棚了。<br>
不是我不想休息，也不是我贪财，是责任，答应的事，对读者做出的承诺，就要尽力做。<br>
人都说老一辈人傻，有的人堵枪眼，有的人身体被火烧着了都一声不吭，有的人不怕疼用身体顶着炸药包炸桥梁。他们根本不是傻，是因为他们心里有信念，那信念像磐石一样不可动摇，为了维护信念，甚至不惜损害自己的健康，甚至牺牲生命。<br>
我当然没有达到这种高度，但是如果我在那个年代，我很有可能就是那样的人。<br>
包括疫情期间去武汉逆风支援的医生也是，我不是医生，我是医生我也会那样做。从这些年我干过的傻事来看，我肯定有这种傻劲。</p>
</blockquote>
<h2 id="二" tabindex="-1"><a class="header-anchor" href="#二"><span>（二）</span></a></h2>
<p>竭尽所能，这既不是一句口号，更不是感动自己的鸡汤。所有努力都必须是真实的，脚踏实地的努力，因为结局不会陪我们演戏。</p>
<p>昨天我听樊登讲《准备》，特别有感触。很少见樊老师将某本书讲了45分钟以上，这本书讲了78分钟。在讲解视频开始的时候，樊老师介绍说，美国教育工作者黛安娜·塔文纳的这本书有国内人大附中校长等校内教育大伽的推荐，听了之后，果然名符其实，非常值得推荐。这本书的内容很丰富，在此仅列举与本文有关的两点：</p>
<ul>
<li>竭尽所能</li>
<li>PBL</li>
</ul>
<h3 id="竭尽所能" tabindex="-1"><a class="header-anchor" href="#竭尽所能"><span>竭尽所能</span></a></h3>
<p>先说第一点，竭尽所能。塔文纳说：</p>
<p>竭尽所能不仅是一句口号，它是我们的文化，是我们做事的一种思维方式和行为准则，是驱动我们前进的力量。我们要始终坚信，总有办法打开一扇锁着的门。</p>
<p>因为她坚持不放弃任何一个孩子，有一次她为了让一个孩子回学校上学，拿到一把改锥跑到孩子家里要撬锁，“总有办法打开一扇锁着的门”就是从里来的。塔文纳自己童年非常不幸，有几次都差点被动辍学，她有这个坚定的信念，与她的童年不幸遭遇是分不开的。</p>
<p>竭尽所能是一种执念，是一种内心坚信必然如此的源动力。我在极客时间录课，是从每日一课开始的，当时小楠是我的责任编辑，负责和我对接。自从开始和小楠合作后，我发现我的内心就一直在受打击。为什么？</p>
<p>因为我的稿件递交上去，不行，打回来修改；修改了又递交上去，还不行，又打回来修改。前后我记得我和小楠在电话里沟通过数次，每次都至少有半个小时以上。做为一个出版过计算机图书，有十几年博客写作经验的作者，我感到的并不是生气，而是惭愧，因为每次修改的理由都很充分。</p>
<p>虽然一件事情站在不同角度，得出的结果是同的，甚至有可能是截然相反的评价。但在稿件修改和视频录制这件事上，我是新手，并且编辑代表的不是她个人，她代表是极客时间整个团队，她给我的建议是经过N多编辑实践之后得出的智慧。有些事我们不懂并不可怕，但如果我们不知道自己不懂更不怕。我们要感谢指出我们不足的人。所以，在改稿这件事上，我从来没有任何怨言。每次来活了，我都是挤出时间，尽快完成，马上完成，马上反馈。</p>
<p>我们今天有微信、邮箱等各种及时沟通工具，相比邮局时代，效率不知道快了多少倍。如果编辑和作者通过信封反馈与改稿，可能半年甚至一年才能完成这个过程。</p>
<p>我到现在还清楚地记得，在每日一课录制结束时，小楠送我下楼问我的一句话，她说：“老师，你的一丝不苟真的让人佩服！”</p>
<p>听到这样的肯定我有点不好意思。由于自己经验缺乏，让对方付出了更多的工作时间和精力，怎么好意思再得到赞美。我说：“我觉得做什么事情，要么不做，要做就要竭尽所能，把事情做好！”</p>
<p>其实小楠不知道，在录课这件事上我特别害怕失败，因为我失败过一次。大概在2018年，我受某个机构邀请，去一个录音棚录课。当时这个机构为了录这个课，租了一天的场地，花了不少钱。当时我没有经验，我以为我到了录音棚，打开电脑自然就能录好。结果那次我搞砸了。真真正正的搞砸了。录制这个事情，就像即兴演讲一样，真的是要准备的。</p>
<p>在极客时间录制《微信小程序全栈开发实战》的时候，计划是每周更新五节，因为开录后我的时间一直都很紧张，白天要在学校讲课，晚上还要备课，只能周末去叶青北园大厦录制。有一次周五晚上我记得很清楚，按计划第二天周六要录制了，我一点还没有备课呢！</p>
<p>怎么办？</p>
<p>所以那天晚上一宿没睡，第二天早上5点的时候把稿子发给了主编。因为我的拖延，编辑只有两个小时的审查、修改时间。</p>
<p>这就是竭尽所能，不做就不做，要做就做好。所以当我听樊登老师讲到塔文纳竭尽所能要让每个学生都考上大学时，我特别有感触。那是她的执念。</p>
<h3 id="什么是pbl" tabindex="-1"><a class="header-anchor" href="#什么是pbl"><span>什么是PBL？</span></a></h3>
<p>再说第二点，PBL。什么是PBL，它是Project-based learning的简写。这个词我也是听《准备》学来的。我原来没有听这本书之前，我写过一篇文章叫《关于知行合一的人工案例实践技术学习理论》，当时我还不知道PBL，如果我知道的话，我就不会大言不惭地涂这篇文章了。原来我想到的内容，这个世界上早有人想过并付诸实践了。读书很重要，这也是领读人的价值所在。</p>
<p>我在罗胖2020-2021跨年演讲中，听到了北京九渡河小学的案例。这个小学很成功，这个小学的学生不上课，上学就是学习磨豆腐、剪纸、制灯笼，这些都是一个个与身边生活结合紧密的实际项目。以磨豆腐为例，学生不仅要拜村里农民伯伯为师把豆腐学会，还要自己写宣传文案，把豆腐卖到村子里。老师则是负责把小学里的知识点，掰开了揉碎了，放在项目里。</p>
<p>九渡河小学的案例，与塔文纳的PBL理念大概是一个意思。</p>
<p>去年年底我去东北一汽大众企业做过短期的企业内训，既讲师，又带学员做项目。短短5天，学员既学习了新语言新技能，又将项目落地了。我回来以后，我自己都惊诧自己居然坚持下来了。有两点困难：一，我事先没有任何准备，现场了解需求现场开发，一边开发一边给学员讲解；二，学员是零基础或完全接近于零基础的，我不但要讲明白，而且更重要的时刻还要考虑学员是不是听明白了。压力特别大。</p>
<p>但是这种培训形式我特别认可，它是一种「软件定制+课程培训」的模式，既培训了学员，学以致用；又开发了项目，后续需求学员自己就可以维护了。我特别推崇这种模式。我觉得这就是PBL理念在程序员编程领域的具体实践。如果你这个需求，欢迎与我联系。</p>
<h3 id="致良知" tabindex="-1"><a class="header-anchor" href="#致良知"><span>致良知</span></a></h3>
<p>最后我想和你再聊一聊「致良知」。这个词语出自二个半完人之一王阳明。之前我对这个词语的理解有些偏差，我觉得良知指的是一种东西，是一种观念，或一种智慧。其实不是的，今天我听完《王阳明大传》三卷，我觉得这个词指的是一种状态，是人处于一种「良知」的状态，而「致良知」就是达到这样一种状态。这是什么状态呢？什么是「良知」状态呢？</p>
<p>其实这种状态每个人都有，或每个人都曾经有过。王阳明龙场悟道，有一天晚上突然从石头上跳起来，说「圣人处此，更有何道」。禅宗六祖慧能在悟道时说「何期自性，本自具足」。这两句话是一个意思，都指内心达到了一种「良知」的状态。而这种状态每个人生来都是具有的，只因后来我们因为欲望、因为执念蒙蔽了双眼，迷失了。而参悟，是消除世俗迷障的过程。</p>
<p>那么我们为什么要说致良知呢？这和本文有什么关系呢？</p>
<p>我们未致良知的时候，是为欲世迷眼、为执念迷路；而当我们致了良知的时候，我们便是竭尽所能。竭尽所能既是致良知的一种附加状态，也可以帮助我们致良知。良知这种状态，不是一旦致过就永远不变的；确实是需要「时时勤拂拭，勿使惹尘埃」的。</p>
<p>欢迎留言讨论。</p>
<p>（2021年02月09日）</p>
<h2 id="三" tabindex="-1"><a class="header-anchor" href="#三"><span>（三）</span></a></h2>
<p>曾几何时我也认为，课程录完了就万事大吉了，直到有一天我自己把课程看完了，看到最终的结课数字，我明白了：课程虽然录完了，服务才刚刚开始。</p>
<p>由于课程时长比一般课程要长，一般课程都是20~30个小时，这个《微信小程序全栈开发实战》竟然有48个小时。一个人不喝不吃不睡，也要两天两夜才能看完。再加上每个人有各自的工作、学习生活，学习时间并不是固定且充裕的，因此课程学习跨度长，往往学完后面的，前面的又忘掉了。</p>
<p>还有一点，就是由于我录课经验不足，我并未能将技术内容讲得像我预想的那样，具有脱口秀式的有趣特征（事实上谦虚地说，应该是一点没有），因此学习完这48个小时的内容，并不是一件轻松的事。再加上我们知道，人都是有惰性的，如果没有人督促，读者很难自律完成课程。</p>
<p>基于以上考虑，我决定在读者中发起一项活动。即日起，凡是完成课程，并主动在部落中晒出完课证书的读者，由我审核，赠送一本js零基础入门教材。图书封面是这样的：</p>
<img src="https://cdn.jsdelivr.net/gh/rixingyike/images/202120210316143815.png" alt="img" style="zoom:50%;" />
<p>这本书是完全面向零基础读者，适合新手学习。如果对这本书不感兴趣，可以商量换另一个我的《小程序从0到1：微信全栈开发工程师一本通》。</p>
<p>很多读者都没有完课，都没有见过结课证书，给大家看一下，结课证书是这样的：</p>
<img src="https://cdn.jsdelivr.net/gh/rixingyike/images/202120210316143630.png" alt="img" style="zoom:33%;" />
<p>活动要求是，需要你将自己的结课证书分享到极客时间的部落中，并艾特我知道。这一期活动数量有限，只有10本，先到先</p>
<p>发起这个活动，并不是单纯想促销，而是想帮助读者朋友们克服惰性，尽快结课。我甚至鼓励学习有进展的读者，在完全每一章，甚至每一课都可以在部落中分享一下自己进展；如果不好意思让别人看到，可以写在笔记里，私发给我其它任何一个朋友。</p>
<p>课程录完了，标志着服务刚刚开始。为了使读者们明确能得到具体什么样的服务内容，我将服务简单列举一下：</p>
<ol>
<li>所有购课学员，都可以<strong>免费使用我在课程中使用的企业开发者帐号</strong>。我们知道，只有企业开发者帐号，才可以体验Webview、Live直播、微信支付等这些功能。申请方法是私信我，告诉我微信，由我手动为你开通。注意每个帐号同时只能添加50个开发者帐号，所以前面申请的学员会优先被移除，拿到帐号要尽快学习。</li>
<li>所有购课学员，都可以<strong>免费使用我在课程中使用的小微商户帐号</strong>。申请一个小微商户并不像申请一个可以支付的企业帐号那样代价高，但也需要大约100块钱，这个价格已经比大部分读者的课单价都高了。小微商户申请略为麻烦，需要时间等等，如果仅是体验，不需要这么复杂，在课程源码中就可以看到我的小微商户帐号及密钥，可以直接测试使用。</li>
<li>可以随时在<strong>课程下方评论区提问互动</strong>。提问内容不限于本课课程中讲到的内容，但凡读者在学习过程中遇到的问题，有疑惑，都可以提问。有的读者腼腆一点，怕别人看到自己的提问，除了提问区提问，还可以与我联系，换一种相对私密的方式，都可以。</li>
<li>我准备做<strong>课程直播答疑</strong>。在一个固定的时间，例如晚上8~9点，每天拿出一个小时，读者在写代码的过程中，遇到什么调试不通的bug，都可以将代码上传到github上，将问题描述清楚，提交给我。所有读者将按照先后顺序，排队在直播间中解答。解答一个读者问题的时候，其它人也可以观看学习。我要挑战的是，读者遇到任何问题，我都能当场找出问题所在，并将之解决。当然我知道这个有难度，如果当时解决不了，下播后我研究一下，第二天再给出答案。具体在哪个平台直播，我还没有想好。可能在知乎。如果极客官方可以，我会优先选择极客时间。如果你有听直播的意见，请告诉我，等人数多了，我就着手开始。</li>
</ol>
<p>最后总结一下吧，线上技术网课培训，在我看来同线下是一样的，同样都是服务。区别在于，线下培训动辄学费就是3~5万起，而线上只需129元，线上价格更划算。有时间官方有活动做促销，最低可以降到19.9块钱。对我自己来讲，给每个线上学员像线下那样一对一辅导，这是不现实的；但我可以做到论坛区问答互动，及集中时间式单线程直播答疑。</p>
<p>我听闻国外SC课程的大学讲师，他们每周都有固定的线上、线下交流时间对外开放，在这些时间段学员可以找他们提问任何问题。我觉得这种模式非常好，有意在效仿他们；还有，我从塔文纳的《准备》这本书中学到PBL这个教育理念，我觉得它是最好的技能学习形式，编程语言包括在内。</p>
<p>单从收益来讲，这个课程并不值得我投入这么大的精力，提供上述四项服务，尤其是最后一项。但从我的志趣来讲，我希望将PBL这个理念在编程教育中发扬光大，同时也需要不断在实践中挑战自己用“有趣而不失严谨”的态度及方式传播技术内容，从这个意义上讲，我和我的读者都在修行，我的收获亦是满满。</p>
<p>最后声明一下，以上服务内容（除了提问区问答互动），特别是直播，并非官方承诺，有任何问题请联系我，客服小姐姐是不管这些事的。</p>
<p>欢迎留言讨论。</p>
<p>（2021年2月14日）</p>
<h2 id="四" tabindex="-1"><a class="header-anchor" href="#四"><span>（四）</span></a></h2>
<p>「持之以恒」看起来只是一句口号，因为我们都明白，做任何事情如果可以持之以恒的话，都可以成功。</p>
<p>难就难在一般人都难以持之以恒，而我们大多数人又都是普通人。不能坚持的原因，不一定就是意志和信念不坚定，可能还有客观上的原因，例如有本职工作要忙，遇到问题被卡住了很痛苦、无法继续等。</p>
<p>据教育心理学研究，我们人类在学习过程中，有两个困难：</p>
<ol>
<li>遇到困难无人解答、无法前进，这是外在的客观困难</li>
<li>不能得到及时反馈、热情难以为继，这里内在的主观困难</li>
</ol>
<h3 id="学习遇到困难怎么办" tabindex="-1"><a class="header-anchor" href="#学习遇到困难怎么办"><span>学习遇到困难怎么办？</span></a></h3>
<p>先说第一个问题，遇到困难了怎么办？问同学、问老师，讨论+请教就可以把困难拿下。因为这样的困难往往并不是真正的困难，有时候只是自己观念认知不到，眼睛被蒙蔽了，才没有看到解决方法。</p>
<p>具体到《<a href="https://time.geekbang.org/course/intro/100052401" target="_blank" rel="noopener noreferrer">微信小程序全栈开发实战</a>》这门课程，可以在课程的留言区问我；也可以把问题留下来，在我直播的代码直接把代码链接发给我，我在你的代码基础上查找问题，尝试将之解决。</p>
<p>为什么要提供第二种方法呢？因为有些问题就是工程实践性比较强的，读者难以描述，解答者也难以领会，代码最直接；此外，采用直播的方式，即惠及更多读者，又锻炼作者本人。</p>
<p>现场查找 Bug，解决疑难，这对作者来说是一个挑战，我想试一试。</p>
<h3 id="学习产生惰性是一种正常现象" tabindex="-1"><a class="header-anchor" href="#学习产生惰性是一种正常现象"><span>学习产生惰性是一种正常现象</span></a></h3>
<p>再说第二个问题，不能得到及时反馈怎么办。</p>
<p>现代教育心理学认为，学习是一个客观的过程，并不单纯是一个主观行为；教育工作者应该把学生产生惰性心理，看作是一种正常现象，而不应该简单归因于学生懒惰、不上进、意志不坚定等主观因素。</p>
<p>学习本来就是一件反人性的事情，如果不能得到及时反馈，学习者很容易迷失方向、丧失学习动力。所有编程初学者基本都有这样的困惑，下面是最近又接到的一位读者的提问，大意是这样的：</p>
<blockquote>
<p>学员没接触过编程，之前做的是编程以外的其它工作（与互联网或电脑有关，但不涉及编程），目前因工作需要，准备学习一下编程，学之前需要准备学习哪些内容呢？</p>
</blockquote>
<p>我的回答是：不要准备，在实践中学习，有问题就问。</p>
<p>从线下学校课堂的实践总结来看，从一门有及时反馈的、简单的、系统化的、相对独立的技术入门学习编程，会坚持得更久，更容易成功。这样的技术以前是 Flash，现在是微信小程序。</p>
<p>有人会说，对于新手来说，像计算机基础、数据结构、算法、设计模式等等，这些都需要准备。其实都可以先不准备。如果将这些东西都准备好了再去学习，学习的热情先被浇灭了。特别像算法这样的大部头，它的作用对新手来讲，要么扼杀学习热情，要么将学员推进培训机构。</p>
<p>这门《<a href="https://time.geekbang.org/course/intro/100052401" target="_blank" rel="noopener noreferrer">微信小程序全栈开发实战</a>》课程，因为当初定位在中级偏上程序员，所以对初级读者会有一些难度。但只要坚持把每节课作者敲过的代码都敲一遍，学过 179 节课，一定会大有收获。有时候有点困难，反而达成后更有成就感。</p>
<p>这门课最大的缺点就是我录的时间太长了，整整 48 小时，179 节课，比一般其它课程多了一倍。课程节数太多，需要长期坚持学习，这对学习者是一个挑战。如何坚持？就是上面我提到的，有问题就问+坚持在反馈中实践。</p>
<h3 id="具体反馈指什么呢" tabindex="-1"><a class="header-anchor" href="#具体反馈指什么呢"><span>具体反馈指什么呢？</span></a></h3>
<p>最后补充一下，上面提到的反馈指什么？</p>
<p>指我们能够看到的、听到的现实表象，例如在终端里敲一下指令，成功了，写一段新功能的代码，编译通过了等等，这些都是正向反馈。还有，同学学习遇到困难，找你请教或讨论，你帮他解决了，这种输出式巩固所学的副产品——来自同学的感谢，也是正向反馈。</p>
<p>编程大多数时间都是一个人做事情，微信小程序这门技术本身是相对独立的、语法简单的，更重要的是它还是个前端技术，它有丰富的表现力，一个按钮、一个图像、一段文本，这些都能给读者带来最直观的感受。而我们人类的大脑就需要这样接地气的反馈。如果学习一门语言，只能在终端里看到文本结果，有时候还只是黑白的，这会大大降低学员对反馈的满足感。</p>
<p>欢迎留言提问。</p>
<p>（2021年2月23日）</p>
</div></template>


